import func

# 사용자의 입력을 받아서 멜론 차트 출력 프로그램 만들기
# 각각 기능(함수)을 만들어서 메인 파일에서 코드 작성
print("===================")
print("1. 멜론 100")
print("2. 멜론 50")
print("3. 멜론 10")
print("4. AI 추천 노래")
print("5. 가수 이름 검색")
print("6. 파일에 저장(멜론100)")
print("7. 멜론 원하는만큼의 순위")
print("===================")
# 만약에 a을 입력하면
# func.m100("멜론 100")
# 만약에 b를 입력하면
# func.m50("멜론 50")
# 만약에 c을 입력하면
# func.m10("멜론 10")
# 만약에 d를 입력하면
# func.m_random("노래추천 기능")
# 만약에 e를 입력하면
# 가수이름 검색 창
# 만약에 f을 입력하면
# 멜론 100을 파일에 저장
# 만약에 g을 입력하면
# func.m000("멜론 내맘데로 출력", 7)